system/blockMeshDict
FoamFile
{
    version 2.0; format ascii; class dictionary; object blockMeshDict;
}

scale 1;

vertices
(
    (0.0000 0.0000 0.0000)
    (5.5000 0.0000 0.0000)
    (5.5000 4.5000 0.0000)
    (0.0000 4.5000 0.0000)
    (0.0000 0.0000 3.6000)
    (5.5000 0.0000 2.8000)
    (5.5000 4.5000 2.8000)
    (0.0000 4.5000 3.6000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (37 30 21) simpleGrading (1 1 1)
);

edges ();

boundary
(
    floor
    {
        type wall;
        faces ( (0 3 2 1) );
    }
    roof
    {
        type wall;
        faces ( (4 5 6 7) );
    }
    wall_high
    {
        type wall;
        faces ( (0 4 7 3) );
    }
    wall_low
    {
        type wall;
        faces ( (1 2 6 5) );
    }
    wall_front
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    wall_back
    {
        type wall;
        faces ( (3 7 6 2) );
    }
);

mergePatchPairs ();
