system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application     buoyantPimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         60;
deltaT          0.005;
writeControl    adjustableRunTime;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  7;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           2;
maxDeltaT       0.25;

functions
{
    wallHeatFlux    { type wallHeatFlux;    libs (fieldFunctionObjects); writeControl writeTime; }
    supplyMassFlow  { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name supply; operation sum;        fields (phi); writeFields false; writeControl writeTime; }
    outletMassFlow  { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name outlet; operation sum;        fields (phi); writeFields false; writeControl writeTime; }
    outletT         { type surfaceFieldValue; libs (fieldFunctionObjects); regionType patch; name outlet; operation areaAverage; fields (T);   writeFields false; writeControl writeTime; }
    roomMeanT       { type volFieldValue;     libs (fieldFunctionObjects); regionType all;   operation volAverage; fields (T);   writeFields false; writeControl writeTime; }
}
