system/createPatchDict
FoamFile
{
    version 2.0; format ascii; class dictionary; object createPatchDict;
}

pointSync false;

patches
(
    { name supply; patchInfo { type patch; } constructFrom set; set supplyFaces; }
    { name outlet; patchInfo { type patch; } constructFrom set; set outletFaces; }
    { name window; patchInfo { type wall;  } constructFrom set; set windowFaces; }
);
