system/surfaceFeaturesDict
FoamFile
{
    version 2.0; format ascii; class dictionary; object surfaceFeaturesDict;
}

surfaces
(
    "person_1.stl"
    "person_2.stl"
    "person_3.stl"
    "equipment.stl"
);
includedAngle 150;
writeObj yes;
